_posts/2018-02-28-org-agenda.html
---
layout: post
title: 使用Org Mode管理日常任务
categories: computers
tags: emacs
excerpt: 使用org mode可以快速地记录某个idea或者任务，并用强大的agenda view配合refile功能组织所有的条目
---
<p>
记录一下使用org mode来做任务管理的一些配置和方法
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">capture: 用最快的速度记下脑中的想法</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>org-capture</code> 用来快速地记下心中一闪而过的某个想法，为了使得速度最快，需要在emacs中任何地方可以唤起这个函数，同时在捕获时减少不必要的输入。
首先定义一个全局快捷键来唤起这个函数
</p>
<div class="org-src-container">

<pre class="src src-lisp">(global-set-key (kbd <span class="org-string">"C-c c"</span>)   'org-capture)
</pre>
</div>
<p>
同时在 <code>org-capture-templates</code> 中定义自定义模板和快捷键
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setq org-capture-templates
      `((<span class="org-string">"t"</span> <span class="org-string">"task"</span> entry (file <span class="org-string">"~/Personal/gtd/inbox.org"</span>)
         <span class="org-string">"* TODO %?\nCaptured %&lt;%Y-%m-%d %H:%M&gt;"</span>) 
        (<span class="org-string">"n"</span> <span class="org-string">"note"</span> entry (file <span class="org-string">"~/Personal/gtd/notes.org"</span>)
         <span class="org-string">"* Note %&lt;%Y-%m-%d %H:%M&gt;\n%?"</span>)))
</pre>
</div>
<p>
这里达到了3个目的：
</p>
<ol class="org-ol">
<li>使用快捷键 <code>t</code> 和 <code>n</code> 分别建立一条 <code>task</code> 或者 <code>note</code>
</li>
<li>分别存放到 <code>inbox.org</code> 和 <code>notes.org</code>
</li>
<li>在模板中自动加入时间戳
</li>
</ol>

<p>
当然在捕获的时候可以同时设置优先级或者截止时间等属性。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">refile: 将任务快速的归类和整理</h2>
<div class="outline-text-2" id="text-2">
<p>
所谓 <code>refile</code> 就是将org文件中的一个subtree移动到另一个tree或者文件下，可以在capture的时候就进行refile，也可以稍后进行。
由于我们所有捕获的任务一开始都在 <code>inbox.org</code> 中，我们给这个文件的所有条目加上全局的 <code>REFILE</code> 标签，以方便在后续的 agenda view中过滤出所有需要refile的任务。只要在org文件的开头加上一行全局tag
</p>
<div class="org-src-container">

<pre class="src src-org"><span class="org-org-meta-line">#+FILETAGS: REFILE</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">agenda: 任务查看和操作面板</h2>
<div class="outline-text-2" id="text-3">
<p>
默认的agenda视图只是列出接下来一周的所有已经scheduled的条目，需要做一些小修改来使得更加好用一些。
首先我们把todo和notes分开
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setq org-agenda-custom-commands
      (quote ((<span class="org-string">"c"</span> <span class="org-string">"Simple agenda view"</span>
               ((agenda <span class="org-string">""</span>)))
              (<span class="org-string">"N"</span> <span class="org-string">"Notes"</span> tags <span class="org-string">"NOTE"</span>
               ((org-agenda-overriding-header <span class="org-string">"Notes"</span>)
                (org-tags-match-list-sublevels t)
                )))))
</pre>
</div>
<p>
在todo的视图内，希望增加一个段落列出所有最高优先级的项目，另一个段落列出所有等待 <code>refile</code> 的条目，最后一个条目列出所有还没有规划日期的条目。
</p>
<div class="org-src-container">

<pre class="src src-lisp">(setq org-agenda-custom-commands
      (quote ((<span class="org-string">"c"</span> <span class="org-string">"Simple agenda view"</span>
         ((tags <span class="org-string">"PRIORITY=\"A\""</span>
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header <span class="org-string">"High-priority unfinished tasks:"</span>)))
          (agenda <span class="org-string">""</span>)
          (tags <span class="org-string">"REFILE"</span>
                ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                 (org-agenda-overriding-header <span class="org-string">"Tasks to Refile"</span>)
                       (org-tags-match-list-sublevels nil)))
          (alltodo <span class="org-string">""</span>
                   ((org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'scheduled))
                    (org-agenda-overriding-header <span class="org-string">"Global list of Un-scheduled tasks:"</span>)
                    ))))

          (<span class="org-string">"N"</span> <span class="org-string">"Notes"</span> tags <span class="org-string">"NOTE"</span>
           ((org-agenda-overriding-header <span class="org-string">"Notes"</span>)
            (org-tags-match-list-sublevels t)))
          )))
</pre>
</div>
<p>
通过 <code>(tags "TAG")</code> 可以筛选出所有带有TAG标签的条目，再配合 <code>org-agenda-skip-function</code> 过滤掉更多的属性，例如
</p>
<div class="org-src-container">

<pre class="src src-lisp">(org-agenda-skip-function
                     '(org-agenda-skip-entry-if 'scheduled))
</pre>
</div>
<p>
会过滤掉所有已经schedule时间的条目。
为了让每个新的段落更清楚，可以用以下方法修改每个段落的标题
</p>
<div class="org-src-container">

<pre class="src src-lisp">(org-agenda-overriding-header <span class="org-string">"Global list of Un-scheduled tasks:"</span>)
</pre>
</div>
<p>
在agenda视图除了可以对某条条目进行常规的设置schedule/deadline，修改tag/property等操作外，还可以进行批量操作。在需要批量处理的条目上用 <code>m</code> 进行mark，然后 <code>B</code> 对所有marked的条目进行后续操作（例如refile或者修改tag等）。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">archive: 归档已完成的任务</h2>
<div class="outline-text-2" id="text-4">
<p>
随着任务越来越多，几个.org文件会变得越来越大，需要定期将已经完成的任务进行归档。我倾向与手动批量归档，可以用以下函数实现
</p>
<div class="org-src-container">

<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-archive-done-tasks</span> ()
  (interactive)
  (org-map-entries
   (<span class="org-keyword">lambda</span> ()
     (org-archive-subtree)
     (setq org-map-continue-from (outline-previous-heading)))
   <span class="org-string">"/DONE"</span> 'agenda))
</pre>
</div>
<p>
每隔一段时间运行一次就行了，会将*.org中的已完成的条目移动到*.org<sub>archive中。</sub>
</p>
</div>
</div>
